update the graph Checkpoint
